{"data":{"site":{"siteMetadata":{"title":"Tan Li Hau","author":"Tan Li Hau"}},"markdownRemark":{"id":"3c04f8ef-c430-57fc-800d-250d6fb3d88a","excerpt":"Motivation Some people said,  “A year in the JavaScript world is equal to 10 years in the outside world.”  It maybe a bit of exaggerated, but it shed some light…","html":"<h1>Motivation</h1>\n<p>Some people said, <em>“A year in the JavaScript world is equal to 10 years in the outside world.”</em> It maybe a bit of exaggerated, but it shed some light on the learning hell of a frontend developer.</p>\n<p><a href=\"https://medium.com/@kamranahmedse\">Kamran Ahmed</a> has written a nice article on <a href=\"https://medium.com/tech-tajawal/modern-frontend-developer-in-2018-4c2072fa2b9c\">frontend developer’s roadmap in 2018</a>, according to him, if you want to be a frontend developer, you would require to learn preprocessors, package managers, frameworks, build tools, and etc. The list keeps going on and honestly it is tough to keep up with all the new things that’s coming out.</p>\n<blockquote>\n<p>So, how should we make sense of all these tools, libraries and frameworks to make ourselves a better frontend developer?</p>\n</blockquote>\n<p>In this post and the posts to come, I would like to share some of my insights on how I navigate around all these ever evolving tools, libraries and frameworks.</p>\n<h1>Disclaimer</h1>\n<p>Before you move on, I have to make some disclaimers.</p>\n<blockquote>\n<p>I am just another frontend developer. I am writing this to share, and hopefully get your feedback, on how to make sense with all the frontend development tools.</p>\n</blockquote>\n<p>And there’s a lot of articles out there for beginners to pick up JavaScript and CSS, and so I am not covering that.</p>\n<blockquote>\n<p>I will be assuming you have a basic understanding on how JavaScript and CSS works in building a web application.</p>\n</blockquote>\n<p>Lastly, the opinions and insights I gathered are from articles, tweets, Github issues, and source code of the libraries.</p>\n<blockquote>\n<p>So some opinions I have might not be the true intention of the library maintainers, but I am giving my perspective in the way I think is the best for me and for you to understand the tools.</p>\n</blockquote>\n<h1>Asking Questions</h1>\n<p>I realised that in 2019, someone new to frontend development, there is a lot of knowledge and concepts required to acquire, plethora of tools to learn, and I persoanlly think that’s a lot to ask. But yet, this is our state of our industry currently.</p>\n<p>Therefore, I am writing down the thought process and concepts that I’ve gained so far, and hoped that these articles would help new comers to the frontend development world a better foothold on understanding the frontend ecosystem.</p>\n<p>When picking up a new tool, I strongly believe that the best way to learn about it is to ask youself, what kind of problems were you facing without this new tool, and how did you solve these problems? Does the new tool solved your problems?</p>\n<p>So, in my humble opinion, the best way of learning all the tools out there in the JavaScript world, is to go back to the basics, ie: writing <a href=\"https://stackoverflow.com/a/20435744/1513547\">Vanilla JavaScript</a> and plain CSS, and start asking questions:</p>\n<ol>\n<li>\n<p><strong>Modularity</strong>. How do I break down my code (JavaScript and CSS alike) into separate modules? How do I <em>“import”</em> then when I need the module? If this module is to be used in multiple projects, how do I share them across projects? or better, how to share the modules to other people around the world?</p>\n</li>\n<li>\n<p>Following up on question <strong>1.</strong>, How do I piece all my <em>“modules”</em> together? How do I download the code for the modules I only when I need it?</p>\n</li>\n<li>\n<p><strong>CSS Modularity</strong>. How do I ensure that in a big application that there’s no naming conflict for my CSS <em>classname</em> or <em>id</em>?</p>\n</li>\n<li>\n<p><strong>Abstraction</strong>. if I can abstract common logic out in JavaScript, how do I have abstraction for CSS?</p>\n</li>\n<li>\n<p>In all fairness, <a href=\"https://github.com/getify/You-Dont-Know-JS\">JavaScript is not the best designed language</a>. JavaScript has its own quirks. So how can JavaScript evolve as a language itself, and how do I make use of the latest language syntax without risking browser compatibility?</p>\n</li>\n<li>\n<p>When I write code, I noticed a common pattern in the code that may cause bugs, for example, using variable without defined it in scope, missing <code class=\"language-text\">default</code> case in <code class=\"language-text\">switch</code> statement, adding <code class=\"language-text\">string</code> with <code class=\"language-text\">number</code>, etc. How do I prevent myself from writing such code? Adding <code class=\"language-text\">string</code> and <code class=\"language-text\">number</code> is still a valid JavaScript code, but it will be a source of problem if we assume the result to be a <code class=\"language-text\">number</code>. How do I make myself to be aware of the <code class=\"language-text\">type</code> of the variable, given that JavaScript is a <a href=\"https://developer.mozilla.org/en-US/docs/Glossary/Dynamic_typing\">dynamically-typed </a> language?</p>\n</li>\n<li>\n<p><strong>Testing</strong>. How should I test my code? If test code explains the behavior of my code, how do I write test code such that when other people reads the test code, they can understand all the quirks and behaviours of my actual code?</p>\n</li>\n<li>\n<p><strong>Test coverage</strong>. How do I ensure that I test all the possible scenarios? How do I know that my code has some impossible path/logic that will never execute, knowing all the possible test cases?</p>\n</li>\n<li>\n<p><strong>Optimisation</strong>. How does the browser downloads and exectues my code? What can I do to optimise the performance of my code? and how do I do it?</p>\n</li>\n</ol>\n<h1>Answering Them</h1>\n<p>The above are questions that I asked, and I am going to answer them one by one in the future articles.</p>","frontmatter":{"title":"Understand the frontend tools","date":"March 16, 2019","description":"About the tools frontend developer used in 2019"}}},"pageContext":{"slug":"/understand-the-frontend-tools/","previous":{"fileAbsolutePath":"/Users/lhtan/Projects/lihautan/content/blog/codemod-with-babel/index.md","fields":{"slug":"/codemod-with-babel/"},"frontmatter":{"title":"Codemod with babel"}},"next":{"fileAbsolutePath":"/Users/lhtan/Projects/lihautan/content/blog/who-accessed-my-property/index.md","fields":{"slug":"/who-accessed-my-property/"},"frontmatter":{"title":"Who accessed my property?"}}}}