{"data":{"site":{"siteMetadata":{"title":"Tan Li Hau","author":"Tan Li Hau"}},"markdownRemark":{"id":"3c04f8ef-c430-57fc-800d-250d6fb3d88a","excerpt":"Motivation Some people said,  “A year in the JavaScript world is equal to 10 years in the outside world.”  It maybe a bit of exaggerated, but it shed some light…","html":"<h1>Motivation</h1>\n<p>Some people said, <em>“A year in the JavaScript world is equal to 10 years in the outside world.”</em> It maybe a bit of exaggerated, but it shed some light on the learning hell of a frontend developer.</p>\n<p><a href=\"https://medium.com/@kamranahmedse\">Kamran Ahmed</a> has written a nice article on <a href=\"https://medium.com/tech-tajawal/modern-frontend-developer-in-2018-4c2072fa2b9c\">frontend developer’s roadmap in 2018</a>, according to him, if you want to be a frontend developer, you would require to learn preprocessors, package managers, frameworks, build tools, and etc. The list keeps going on and honestly it is tough to keep up with all the new things that’s coming out.</p>\n<blockquote>\n<p>So, how should we make sense of all these tools, libraries and frameworks to make ourselves a better frontend developer?</p>\n</blockquote>\n<p>In this post and the posts to come, I would like to share some of my insights on how I navigate around all these ever evolving tools, libraries and frameworks.</p>\n<h1>Disclaimer</h1>\n<p>Before you move on, I have to make some disclaimers.</p>\n<blockquote>\n<p>I am just another frontend developer. I am writing this to share, and hopefully get your feedback, on how to make sense with all the frontend development tools.</p>\n</blockquote>\n<p>And there’s a lot of articles out there for beginners to pick up JavaScript and CSS, and so I am not covering that.</p>\n<blockquote>\n<p>I will be assuming you have a basic understanding on how JavaScript and CSS works in building a web application.</p>\n</blockquote>\n<p>Lastly, the opinions and insights I gathered are from articles, tweets, Github issues, and source code of the libraries.</p>\n<blockquote>\n<p>So some opinions I have might not be the true intention of the library maintainers, but I am giving my perspective in the way I think is the best for me and for you to understand the tools.</p>\n</blockquote>\n<h1>The problem</h1>\n<p>I realised that in 2019, someone new to frontend development, there is a lot of knowledge and concepts required to acquire, plethora of tools to learn, and I persoanlly think that’s a lot to ask. But yet, this is our state of our industry currently.</p>\n<p>Therefore, I am writing down the thought process and concepts that I’ve gained so far, and hoped that these articles would help new comers to the frontend development world a better foothold on understanding the frontend ecosystem.</p>\n<p>When picking up a tool or concept, I strongly believe that instead of reading the docs to grasp what the tool is for or how it is intended, we should instead look at how things were done before the tool, and how things have improved with the tool, and therefore what problem has the tool solved.</p>\n<p>So the best way of learning in my opinion is to go back to the basics, ie: writing <a href=\"https://stackoverflow.com/a/20435744/1513547\">Vanilla JavaScript</a> and plain CSS, and start asking questions:</p>\n<ol>\n<li>\n<p><strong>Modularity</strong>. How do I break down my code (JavaScript and CSS alike) into separate modules? How do I “import” then when I need the module? If this module is to be used in multiple projects, how do I share them across projects? or better, how to share the modules to other people around the world?</p>\n</li>\n<li></li>\n</ol>","frontmatter":{"title":"Understand the frontend tools","date":"March 16, 2019","description":"About the tools frontend developer used in 2019"}}},"pageContext":{"slug":"/understand-the-frontend-tools/","previous":{"fields":{"slug":"/codemod-with-babel/"},"frontmatter":{"title":"Codemod with babel"}},"next":null}}