{"data":{"site":{"siteMetadata":{"title":"Tan Li Hau","author":"Tan Li Hau"}},"markdownRemark":{"id":"c43327c6-97a4-5f8f-9287-54ea6f283295","excerpt":"1. What is Travis CI Travis CI  is a  Continuous Integration  service used to build and test software projects hosted at  GitHub .\nOr in simple terms, when you…","html":"<h1>1. What is Travis CI</h1>\n<blockquote>\n<p><strong><a href=\"https://travis-ci.org\">Travis CI</a></strong> is a <strong>Continuous Integration</strong> service used to build and test software projects hosted at <a href=\"https://github.com\">GitHub</a>.\nOr in simple terms, when you push a commit to the master branch of your project hosted at GitHub, Travis CI will run tests and build the latest commit of your master branch.</p>\n</blockquote>\n<p>It’s that simple. You push a commit → Travis CI run tests and build. Automatically.</p>\n<hr>\n<h1>2. How do I use Travis CI</h1>\n<p>Go to Travis CI. Sign in using your GitHub account. You will be prompted to authorise Travis CI to your GitHub account. Approved that.</p>\n<p>When you see something like this:</p>\n<p>Voila. You have created a Travis CI account.</p>\n<p>Next thing you are going to do is to click the (+) button beside the “My Repositories” on the left.</p>\n<p>You will then see a list of projects on your GitHub.</p>\n<p>If the list of repositories is empty, click “Sync account” to fetch all your repositories.</p>\n<p>Turn on one of your project for Continuous Integration!</p>\n<p>That’s all.</p>\n<h1>3. How to build a Node.js project using Travis CI</h1>\n<p>Create a file name .travis.yml at the root folder of your project.</p>\n<p>Copy this into the file.</p>\n<p>.travis.yml\nCommit and Push. That’s simple.</p>\n<p>Or if you are lazy, run this:</p>\n<p>The version of Node.js I am using is 4.2 at the time of writing this article. To be safe, you can run “node — version” on your command line to determine which version of Node.js you are running.</p>\n<p>Make sure that you have all your dependencies persists to the package.json as Travis CI will install all the dependencies from it by calling npm install.\nAnother thing to take note is that if you wanna run your test script, make sure to include it in the package.json.</p>\n<h1>4. How do I use bower and install bower dependencies</h1>\n<p>If you are using bower, add a before_script for .travis.yml</p>\n<p>Or likewise if you are lazy, copy and paste this to your command line.</p>\n<p>One thing to take note for bower is that when there is dependency conflict, bower will ask you to choose which version of the dependency to be installed interactively. In the case for Travis CI, Travis CI will not know which version to install it for you where you will see an error like this:</p>\n<p>The command “bower install” failed and exited with 1 during .\nTherefore, you will have to persists the resolution to bower.json to avoid the build error.</p>\n<h1>5. Include a Travis CI badge</h1>\n<p>To summarise, you have set up your Travis CI, copied and pasted the .travis.yml to your project, commited and pushed your project to GitHub, and Travis CI had built and tested your project.</p>\n<p>Now, it’s time to add a badge to your GitHub repository!</p>\n<p>Simply clicked the badge in Travis CI and choose for Markdown.</p>\n<p>Copy and paste the line into your README.md.</p>\n<p>Commit and Push.</p>\n<p>And now you have a Travis CI badge on your repo!</p>","frontmatter":{"title":"5 Steps to build NodeJS using Travis CI","date":"April 13, 2016","description":null}}},"pageContext":{"slug":"/5-steps-to-build-nodejs-using-travis-ci/","previous":{"fields":{"slug":"/hi-folks/"},"frontmatter":{"title":"New Beginnings"}},"next":null}}